NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A010F1536GM40.svd
        <register>
          <name>ADPC7</name>
          <description>No Description</description>
          <addressOffset>0x348</addressOffset>
          <access>read-write</access>
          <resetValue>0x0C0D0E10</resetValue>
          <resetMask>0x1F1F1F1F</resetMask>
          <fields>
            <field>
              <name>ADBBSSAMPLUT12</name>
              <description>ADBBSS amp LUT 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADBBSSAMPLUT13</name>
              <description>ADBBSS amp LUT 13</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADBBSSAMPLUT14</name>
              <description>ADBBSS amp LUT 14</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADBBSSAMPLUT15</name>
              <description>ADBBSS amp LUT 15</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPC8</name>
          <description>No Description</description>
          <addressOffset>0x34C</addressOffset>
          <access>read-write</access>
          <resetValue>0x2F87C145</resetValue>
          <resetMask>0xFFFFFF7F</resetMask>
          <fields>
            <field>
              <name>ADPCOSR</name>
              <description>ADPCOSR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADPCANTSAMPOFFSET</name>
              <description>ADPCANTSAMPOFFSET</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADPCANTSAMPSWITCHWAIT</name>
              <description>ADPCANTSAMPSWITCHWAIT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADPCANTSAMPBUF</name>
              <description>ADPCANTSAMPBUF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADPCANTSAMPWRITE</name>
              <description>ADPCANTSAMPWRITE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADPCANTSAMPSWITCH</name>
              <description>ADPCANTSAMPSWITCH</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPC9</name>
          <description>No Description</description>
          <addressOffset>0x350</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>ADBBSSAMPAVGLIM</name>
              <description>ADBBSSAMPAVGLIM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADBBSSAMPTHR</name>
              <description>ADBBSSAMPTHR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADBBSSSYNCEN</name>
              <description>Enable sync of BBSS</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Do not synchronize BBSS to antenna switching</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Synchronize BBSS to anetnna switching</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADBBSSUPTHR</name>
              <description>BBSS increase threshold</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADBBSSDNTHR</name>
              <description>BBSS decrease threshold</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPC10</name>
          <description>No Description</description>
          <addressOffset>0x354</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <fields>
            <field>
              <name>ADBBSSAMPJUMP</name>
              <description>ADBBSSAMPJUMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADBBSSCHANGEEN</name>
              <description>ADBBSSCHANGEEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable BBSS change indicator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable BBSS change indicator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADBBSSCHGUPTHR</name>
              <description>ADBBSSCHGUPTHR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADBBSSCHGDNTHR</name>
              <description>ADBBSSCHGDNTHR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HADMCTRL0</name>
          <description>No Description</description>
          <addressOffset>0x3B0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFC00703F</resetMask>
          <fields>
            <field>
              <name>HADMEN</name>
              <description>Enable HADM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TESEN</name>
              <description>Tone Exchange Step Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PESEN</name>
              <description>Packet Exchange Step Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNDSEQEN</name>
              <description>Sounding Sequence Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROLE</name>
              <description>HADM Role</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INITIATOR</name>
                  <description>Device is the initiator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFLECTOR</name>
                  <description>Device is the reflector</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTTPHY</name>
              <description>PHY Used for RTT Packets</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PM</name>
              <description>Phase Measurement Time</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVGMODE</name>
              <description>Averaging Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHASEAMP</name>
                  <description>Phase / amplitude polar averaging</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IQ</name>
                  <description>I,Q Cartesian averaging</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFTSCALE</name>
              <description>DFT INPUT Scale</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTSENTSEL</name>
              <description>RTT Packet Sent Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BAUD_PRESENT</name>
                  <description>Use BAUD_PRESENT as indication of packet sent. Before modulator CDC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_PRESENT</name>
                  <description>Use MOD_PRESENT as indication of packet TX. After modulator CDC</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXUPSAMPOSR4</name>
              <description>TX symbol UP Sampling by 4</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSAFCGEAR</name>
              <description>SS AFC Gear SW</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRC2AUTOSCALE</name>
              <description>SRC2 Autoscaling Debug Output</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HADMCTRL1</name>
          <description>No Description</description>
          <addressOffset>0x3B4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00040000</resetValue>
          <resetMask>0xFFC7FF07</resetMask>
          <fields>
            <field>
              <name>STEPSTATE</name>
              <description>State for HADM HW to execute</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>IDLE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I_FREQ_COMP</name>
                  <description>I_FREQ_COMP</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_FREQ_COMP_FREQ_MEAS</name>
                  <description>R_FREQ_COMP_FREQ_MEAS</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I_PES</name>
                  <description>I_PES</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_PES</name>
                  <description>R_PES</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_PES_TES</name>
                  <description>R_PES_TES</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_TES</name>
                  <description>R_TES</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I_TES</name>
                  <description>I_TES</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFTSTARTOFF</name>
              <description>DFT Start Point Offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAXSCHWIN</name>
              <description>SCH WINDOW SIZE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVGSTARTOFF</name>
              <description>AVG Start Point Offset</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HADMSTATUS0</name>
          <description>No Description</description>
          <addressOffset>0x3B8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AVG0</name>
              <description>Average 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AVG1</name>
              <description>Average 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HADMSTATUS1</name>
          <description>No Description</description>
          <addressOffset>0x3BC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREQOFFSET</name>
              <description>Frequency offset measurement</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMETOX</name>
              <description>Time for ToX</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HADMSTATUS2</name>
          <description>No Description</description>
          <addressOffset>0x3C0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>COSTLATE1</name>
              <description>LATE COST-1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COSTCURR1</name>
              <description>CURR COST-1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COSTEARL1</name>
              <description>EARLY COST-1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HADMSTATUS3</name>
          <description>No Description</description>
          <addressOffset>0x3C4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>COSTLATE0</name>
              <description>LATE COST-0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COSTCURR0</name>
              <description>CURR COST-0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COSTEARL0</name>
              <description>EARLY COST-0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HADMSTATUS4</name>
          <description>No Description</description>
          <addressOffset>0x3C8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFF7FFF</resetMask>
          <fields>
            <field>
              <name>SBSP500I</name>
              <description>Postive 500K Real </description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBSP500Q</name>
              <description>Postive 500K Imag </description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HADMSTATUS5</name>
          <description>No Description</description>
          <addressOffset>0x3CC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFF7FFF</resetMask>
          <fields>
            <field>
              <name>SBSM500I</name>
              <description>Negtive 500K Real </description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBSM500Q</name>
              <description>Negtive 500K Imag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HADMSTATUS6</name>
          <description>No Description</description>
          <addressOffset>0x3D0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFF0FFFF</resetMask>
          <fields>
            <field>
              <name>FREQMEAS</name>
              <description>Frequency Compensation Measurement</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBSPSCALE</name>
              <description>Positive Frequency Scale</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBSMSCALE</name>
              <description>Negative Frequency Scale</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC2NCOCTRL</name>
          <description>No Description</description>
          <addressOffset>0x3E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <fields>
            <field>
              <name>SRC2NCOEN</name>
              <description>Enable SRC2 NCO supplemental clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHASEPERCLK</name>
              <description>Phase step per clock cycle</description>
              <bitOffset>1</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPARE</name>
          <description>No Description</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>SPARE</name>
              <description>Spare register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
